{
  "courses": [
    {
      "title": "Robotics",
      "filename": "robotics",
      "description": "Explore the world of robotics with a comprehensive course covering the fundamentals of robotic systems, sensors, actuators, and programming techniques. Develop hands-on skills to design and build your own robots for various applications."
    },
    {
      "title": "Embedded Systems & IoT",
      "filename": "embedded",
      "description": "Dive into the world of embedded systems, exploring the design and implementation of computer systems integrated into devices for real-world applications. Learn about hardware-software interaction and gain practical skills in developing embedded solutions."
    },
    {
      "title": "Cloud Computing",
      "filename": "cloudcomputing",
      "description": "Master the principles of cloud computing and understand how to leverage cloud services for scalable and flexible solutions. Learn about cloud architecture, deployment models, and key cloud providers in the industry."
    },
    {
      "title": "Data Science",
      "filename": "datascience",
      "description": "Immerse yourself in the field of data science, covering statistical analysis, machine learning, and data visualization. Gain hands-on experience with data manipulation and analysis tools to extract valuable insights from datasets."
    },
    {
      "title": "Python Full Stack",
      "filename": "python",
      "description": "Become proficient in full-stack web development using Python. Learn to build dynamic and interactive web applications using popular frameworks like Django or Flask for the backend and front-end technologies for the user interface."
    },
    {
      "title": "Java Full Stack",
      "filename": "java",
      "description": "Explore full-stack development with Java, covering both backend and frontend technologies. Build scalable and robust web applications using Java frameworks like Spring Boot for the backend and modern frontend frameworks for the user interface."
    },
    {
      "title": "MERN Stack",
      "filename": "mern",
      "description": "Master the art of fullstack web development using the MERN stack (MongoDB, Express.js, React.js, Node.js). Dive into database design, server-side scripting, client-side development, and deployment strategies to build scalable and efficient web applications."
    },
    {
      "title": "React Native",
      "filename": "reactnative",
      "description": "Learn to develop cross-platform mobile applications using React Native. Gain expertise in building native-like experiences for both iOS and Android platforms using a single codebase. Explore UI components, navigation, and integration with backend services."
    },
    {
      "title": "Flutter",
      "filename": "flutter",
      "description": "Delve into Flutter, Google's UI toolkit for building natively compiled applications for mobile, web, and desktop from a single codebase. Develop skills in creating beautiful and responsive user interfaces, managing state, and integrating Flutter applications with backend services."
    }
  ]
}
